In [1]:
import pandas as pd

df = pd.read_csv('../../data2/GlobalLandTemperaturesByCity.csv')
df

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
...,...,...,...,...,...,...,...
8599207,2013-05-01,11.464,0.236,Zwolle,Netherlands,52.24N,5.26E
8599208,2013-06-01,15.043,0.261,Zwolle,Netherlands,52.24N,5.26E
8599209,2013-07-01,18.775,0.193,Zwolle,Netherlands,52.24N,5.26E
8599210,2013-08-01,18.025,0.298,Zwolle,Netherlands,52.24N,5.26E
8599211,2013-09-01,NaN,NaN,Zwolle,Netherlands,52.24N,5.26E

In [2]:
cl = df['City'].values.tolist()
len(set(cl))

3448

In [5]:
df1 = df[df['dt']=='2013-05-03']
df['year']=df['dt'].apply(lambda x: x.split('-')[0])
df['month']=df['dt'].apply(lambda x: x.split('-')[1])
df['day']=df['dt'].apply(lambda x: x.split('-')[2])
df

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,year,month,day
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E,1743,11,01
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E,1743,12,01
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E,1744,01,01
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E,1744,02,01
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E,1744,03,01
...,...,...,...,...,...,...,...,...,...,...
8599207,2013-05-01,11.464,0.236,Zwolle,Netherlands,52.24N,5.26E,2013,05,01
8599208,2013-06-01,15.043,0.261,Zwolle,Netherlands,52.24N,5.26E,2013,06,01
8599209,2013-07-01,18.775,0.193,Zwolle,Netherlands,52.24N,5.26E,2013,07,01
8599210,2013-08-01,18.025,0.298,Zwolle,Netherlands,52.24N,5.26E,2013,08,01
8599211,2013-09-01,NaN,NaN,Zwolle,Netherlands,52.24N,5.26E,2013,09,01

In [7]:
df5 = df[(df['month']=='08') & (df['year'] == '2010')]

In [8]:
df5

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,year,month,day
3201,2010-08-01,16.898,0.256,Århus,Denmark,57.05N,10.33E,2010,08,01
6440,2010-08-01,26.774,0.322,Çorlu,Turkey,40.99N,27.69E,2010,08,01
9569,2010-08-01,24.577,0.414,Çorum,Turkey,40.99N,34.08E,2010,08,01
11887,2010-08-01,16.881,0.325,Öskemen,Kazakhstan,50.63N,82.39E,2010,08,01
14205,2010-08-01,23.153,0.553,Ürümqi,China,44.20N,87.20E,2010,08,01
...,...,...,...,...,...,...,...,...,...,...
8587482,2010-08-01,25.564,0.318,Zouxian,China,36.17N,117.35E,2010,08,01
8589567,2010-08-01,24.796,0.302,Zunyi,China,28.13N,106.36E,2010,08,01
8592806,2010-08-01,15.535,0.266,Zurich,Switzerland,47.42N,8.29E,2010,08,01
8595935,2010-08-01,27.848,0.260,Zuwarah,Libya,32.95N,12.45E,2010,08,01
8599174,2010-08-01,16.912,0.222,Zwolle,Netherlands,52.24N,5.26E,2010,08,01